blog/my-mvn-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My MVN Notes</title>
<!-- 2020-03-28 Sat 17:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">My MVN Notes</h1>
<ol class="org-ol">
<li>To view dependency tree:
</li>
</ol>
<pre class="example">
mvn dependency:tree
</pre>
<ol class="org-ol">
<li>To skip running test:
</li>
</ol>
<pre class="example">
mvn install -DskipTests
mvn install -DskipTests=true  //to override skipTests property in pom
</pre>
<ol class="org-ol">
<li>To skip compiling and runing tests:
</li>
</ol>
<pre class="example">
mvn install -Dmaven.test.skip=true
</pre>
<ol class="org-ol">
<li>To run maven in offline mode, to avoid downloading:
</li>
</ol>
<pre class="example">
mvn -o install
mvn --offline install
</pre>
<ol class="org-ol">
<li>To force check for updates of snapshots and releases from remote repositories:
</li>
</ol>
<pre class="example">
mvn -U install
mvn --update-snapshots install
</pre>
<ol class="org-ol">
<li>To list all maven profiles, and see which is the active profile:
</li>
</ol>
<pre class="example">
mvn help:all-profiles
</pre>
<ol class="org-ol">
<li>To override maven surefire plugin forkMode:
</li>
</ol>
<pre class="example">
mvn test -DforkMode=never
mvn test -DforkMode=always
</pre>


<p>
source: <a href="http://javahowto.blogspot.com/search/label/Tools">http://javahowto.blogspot.com/search/label/Tools</a>
</p>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>